/***************************************************************************************************************
| Project Name: GM Gateway Diagnostic Addon
|    File Name: Ggda.c
|
|  Description: GM Gateway Diagnostic Addon.
|  
|---------------------------------------------------------------------------------------------------------------
|               C O P Y R I G H T
|---------------------------------------------------------------------------------------------------------------
| Copyright (c) 2005-2012 Vctr Informatik GmbH            All rights reserved.
|
|                         This software is copyright protected and 
|                         proprietary to Vctr Informatik GmbH.
|                         Vctr Informatik GmbH grants to you only
|                         those rights as set out in the license conditions.
|                         All other rights remain with Vctr Informatik GmbH.
|
|---------------------------------------------------------------------------------------------------------------
|               A U T H O R   I D E N T I T Y
|---------------------------------------------------------------------------------------------------------------
| Initials     Name                      Company
| --------     ---------------------     -----------------------------------------------------------------------
| Sa           Mishel Shishmanyan        Vctr Informatik GmbH
| Mhe          Matthias Heil             Vctr Informatik GmbH

#define GGDA_EV_RX_A9_80                                             ((GgdaEventType)(0x0100))
#define GGDA_EV_RX_A9_81                                             ((GgdaEventType)(0x0200))
#define GGDA_EV_RX_A9_82                                             ((GgdaEventType)(0x0400))
#define GGDA_EV_RX_A9_8X                                             ((GgdaEventType)(GGDA_EV_RX_A9_80 | GGDA_EV_RX_A9_81 | GGDA_EV_RX_A9_82))

#define GGDA_EV_ACTIVATE_VN                                          ((GgdaEventType)(0x1000))

/*-------------------------*/
/*         Timers          */
/*-------------------------*/
#define GGDA_TIMER_S1                                                ((GgdaTimerHandle)0)
#define GGDA_TIMER_P2                                                ((GgdaTimerHandle)1)
#define GGDA_TIMER_VN                                                ((GgdaTimerHandle)2)
#define GGDA_TIMER_UUDT_CONF                                         ((GgdaTimerHandle)3)

#if (GGDA_CONFIG_SERVICE_A9_SUPPORT == GGDA_CONFIG_ON)
# define GGDA_NUM_TIMERS                                             4
#else
# define GGDA_NUM_TIMERS                                             3
#endif

/*-------------------------*/
/*         Modes           */
/*-------------------------*/
#define kGgdaProgModeNone                                            ((vbittype)0x00)
#define kGgdaProgModeAcceptedLS                                      ((vbittype)0x01)
#define kGgdaProgModeAcceptedHS                                      ((vbittype)0x02)
#define kGgdaProgModeActive                                          ((vbittype)0x03)


#define kGgdaUsdtTxModeResNone                                       ((vbittype)0x00)
#define kGgdaUsdtTxModeResRcrRp                                      ((vbittype)0x01)
#define kGgdaUsdtTxModeResFinal                                      ((vbittype)0x02)
#define kGgdaUsdtTxModeResUnsol                                      ((vbittype)0x03)


/*-------------------------*/
/*        A9 Modes         */
/*-------------------------*/
/* temp buffer lengths */
#define kGgdaSvcA9BufferLen                                          6/* some CPUs could copy word instead of bytes*/

#define kGgdaRdiMode80                                               ((vbittype)0x01u)
#define kGgdaRdiMode81                                               ((vbittype)0x02u)
#define kGgdaRdiMode82                                               ((vbittype)0x04u)

#if (GGDA_CONFIG_SERVICE_A9_82_SUPPORT == GGDA_CONFIG_ON)
#define kGgdaRdiLastMode                                             (kGgdaRdiMode82)
#define kGgdaRdiModeMask                                             ((vbittype)(kGgdaRdiMode80 | kGgdaRdiMode81 | kGgdaRdiMode82))
#else
#define kGgdaRdiLastMode                                             (kGgdaRdiMode81)
#define kGgdaRdiModeMask                                             ((vbittype)(kGgdaRdiMode80 | kGgdaRdiMode81))
#endif

/*---------------------*/
/* Internal data types */
/*---------------------*/
typedef struct
{
  vbittype  isFuncReq          : 1;
  vbittype  isCommHalted       : 1;
  vbittype  isResActive        : 1;
  vbittype  progMode           : 2; /* 00 - none, 01 - acceptedLowSpeed, 02 - acceptedHiSpeed, 03 - active */

  vbittype  isTxModeActivity   : 2; /* 00 - none, 01 - rcrRp, 02 - final, 03 - unsolicited */
  vbittype  isRxModeActive     : 1;
  vbittype  isUsdtBufferLocked : 1;
  vbittype  isDiagActive       : 1;
}GgdaStateEngineType;

#if (GGDA_CONFIG_SERVICE_A9_82_SUPPORT == GGDA_CONFIG_ON)
typedef struct
{
  vbittype  is81ModeActive    :1;/* 0x00 - No, 0x01 - Yes,  */
  vbittype  isLastDtcFound    :1;/* 0x00 - No, 0x01 - Yes,  */
  vbittype  isFirstAnswer     :3;/* 0x00 - None, 0x01 - for 0x80, 0x02 - for 0x81, 0x04 - for 0x82, */
  vbittype  answerMode        :3;/* 0x00 - none, 0x01 - 0x80, 0x02 - 0x81, 0x04 - 0x82 */
  vbittype  is82ModeActive    :1;/* 0x00 - No, 0x01 - Yes,  */
  vbittype  isUudtBufferLocked:1;
}GgdaRdiStateCtrlType;
#else
typedef struct
{
  vbittype  is81ModeActive    :1;/* 0x00 - No, 0x01 - Yes,  */
  vbittype  isLastDtcFound    :1;/* 0x00 - No, 0x01 - Yes,  */
  vbittype  isFirstAnswer     :2;/* 0x00 - None, 0x01 - for 0x80, 0x02 - for 0x81 */
  vbittype  answerMode        :2;/* 0x00 - none, 0x01 - 0x80, 0x02 - 0x81 */
  vbittype  isUudtBufferLocked:1;
}GgdaRdiStateCtrlType;
#endif

 /* Take care if more events needed by a task to enlarge these types!!!*/
typedef vuint16 GgdaEventType;
typedef vuintx  GgdaTimerHandle;
typedef vuintx  GgdaTimerEventType;

/* Communication */
typedef struct
{
  GgdaStateEngineType stateMachine;
  GgdaEventType       eventRegister;
  GgdaNrcType         errorRegister;
  vuint8              numActiveTimers;
  vuint16             timers[GGDA_NUM_TIMERS];
#if (GGDA_CONFIG_SERVICE_A9_SUPPORT == GGDA_CONFIG_ON)
  /* Service A9 state machine */
  GgdaRdiStateCtrlType rdiStateCtrl;
  /* global storage of the searching masks */
  vuint8         rdi81SearchStatusMask;
  /* global current iterator value */
  vuint16        nextIterPos;
  /* global check mask for request */
  vuint8         nextMode;
  /* buffer for the asynchronous application writing */
  /* for mode 0x80 and 0x81 */
