/**********************************************************************************************************************
* Module File Name  : flxa_regs.h
* Module Description: FlexRay Peripheral Registers
* Project           : CBD
* Author            : Lucas Wendling
***********************************************************************************************************************
* Version Control:
* %version:          2 %
* %derived_by:       czgng4 %
*----------------------------------------------------------------------------
* Date      Rev      Author         Change Description
* -------   -------  --------  ----------------------------------------------
* 12/16/14  1        LWW       Initial version derived from dr7f701311.dvf.h v1 in tools directory
* 09/14/15  2        NJS       Updated to account for changes in dr7f701311.dvf.h v2 in tools directory
**********************************************************************************************************************/

#ifndef FLXA_REGS_H
#define FLXA_REGS_H

/**********************************************************************************************************************
* Include files
 *********************************************************************************************************************/
#include "Std_Types.h"
#include "reg_common.h"

typedef struct 
{                                                          /* Bit Access       */
    uint8  OE:1;                                           /* OE               */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  OEP:1;                                          /* OEP              */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  T0IE:1;                                         /* T0IE             */
    uint8  T1IE:1;                                         /* T1IE             */
    uint8  T2IE:1;                                         /* T2IE             */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type0;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  OS:1;                                     /* OS               */
    uint8  :7;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  T0IS:1;                                         /* T0IS             */
    uint8  T1IS:1;                                         /* T1IS             */
    uint8  T2IS:1;                                         /* T2IS             */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type1;
typedef struct 
{                                                          /* Bit Access       */
    uint8  CLK:8;                                          /* CLK[7:0]         */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type2;
typedef struct 
{                                                          /* Bit Access       */
    uint8  PEMC:1;                                         /* PEMC             */
    uint8  CNA:1;                                          /* CNA              */
    uint8  SFBM:1;                                         /* SFBM             */
    uint8  SFO:1;                                          /* SFO              */
    uint8  CCF:1;                                          /* CCF              */
    uint8  CCL:1;                                          /* CCL              */
    uint8  AERR:1;                                         /* AERR             */
    uint8  RFO:1;                                          /* RFO              */
    uint8  EFA:1;                                          /* EFA              */
    uint8  IIBA:1;                                         /* IIBA             */
    uint8  IOBA:1;                                         /* IOBA             */
    uint8  MHF:1;                                          /* MHF              */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  EDA:1;                                          /* EDA              */
    uint8  LTVA:1;                                         /* LTVA             */
    uint8  TABA:1;                                         /* TABA             */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  EDB:1;                                          /* EDB              */
    uint8  LTVB:1;                                         /* LTVB             */
    uint8  TABB:1;                                         /* TABB             */
    uint8  :5;                                             /* Reserved Bits    */
} __type3;
typedef struct 
{                                                          /* Bit Access       */
    uint8  WST:1;                                          /* WST              */
    uint8  CAS:1;                                          /* CAS              */
    uint8  CYCS:1;                                         /* CYCS             */
    uint8  TXI:1;                                          /* TXI              */
    uint8  RXI:1;                                          /* RXI              */
    uint8  RFNE:1;                                         /* RFNE             */
    uint8  RFCL:1;                                         /* RFCL             */
    uint8  NMVC:1;                                         /* NMVC             */
    uint8  TI0:1;                                          /* TI0              */
    uint8  TI1:1;                                          /* TI1              */
    uint8  TIBC:1;                                         /* TIBC             */
    uint8  TOBC:1;                                         /* TOBC             */
    uint8  SWE:1;                                          /* SWE              */
    uint8  SUCS:1;                                         /* SUCS             */
    uint8  MBSI:1;                                         /* MBSI             */
    uint8  SDS:1;                                          /* SDS              */
    uint8  WUPA:1;                                         /* WUPA             */
    uint8  MTSA:1;                                         /* MTSA             */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  WUPB:1;                                         /* WUPB             */
    uint8  MTSB:1;                                         /* MTSB             */
    uint8  :6;                                             /* Reserved Bits    */
} __type4;
typedef struct 
{                                                          /* Bit Access       */
    uint8  PEMCL:1;                                        /* PEMCL            */
    uint8  CNAL:1;                                         /* CNAL             */
    uint8  SFBML:1;                                        /* SFBML            */
    uint8  SFOL:1;                                         /* SFOL             */
    uint8  CCFL:1;                                         /* CCFL             */
    uint8  CCLL:1;                                         /* CCLL             */
    uint8  AERRL:1;                                        /* AERRL            */
    uint8  RFOL:1;                                         /* RFOL             */
    uint8  EFAL:1;                                         /* EFAL             */
    uint8  IIBAL:1;                                        /* IIBAL            */
    uint8  IOBAL:1;                                        /* IOBAL            */
    uint8  MHFL:1;                                         /* MHFL             */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  EDAL:1;                                         /* EDAL             */
    uint8  LTVAL:1;                                        /* LTVAL            */
    uint8  TABAL:1;                                        /* TABAL            */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  EDBL:1;                                         /* EDBL             */
    uint8  LTVBL:1;                                        /* LTVBL            */
    uint8  TABBL:1;                                        /* TABBL            */
    uint8  :5;                                             /* Reserved Bits    */
} __type5;
typedef struct 
{                                                          /* Bit Access       */
    uint8  WSTL:1;                                         /* WSTL             */
    uint8  CASL:1;                                         /* CASL             */
    uint8  CYCSL:1;                                        /* CYCSL            */
    uint8  TXIL:1;                                         /* TXIL             */
    uint8  RXIL:1;                                         /* RXIL             */
    uint8  RFNEL:1;                                        /* RFNEL            */
    uint8  RFCLL:1;                                        /* RFCLL            */
    uint8  NMVCL:1;                                        /* NMVCL            */
    uint8  TI0L:1;                                         /* TI0L             */
    uint8  TI1L:1;                                         /* TI1L             */
    uint8  TIBCL:1;                                        /* TIBCL            */
    uint8  TOBCL:1;                                        /* TOBCL            */
    uint8  SWEL:1;                                         /* SWEL             */
    uint8  SUCSL:1;                                        /* SUCSL            */
    uint8  MBSIL:1;                                        /* MBSIL            */
    uint8  SDSL:1;                                         /* SDSL             */
    uint8  WUPAL:1;                                        /* WUPAL            */
    uint8  MTSAL:1;                                        /* MTSAL            */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  WUPBL:1;                                        /* WUPBL            */
    uint8  MTSBL:1;                                        /* MTSBL            */
    uint8  :6;                                             /* Reserved Bits    */
} __type6;
typedef struct 
{                                                          /* Bit Access       */
    uint8  PEMCE:1;                                        /* PEMCE            */
    uint8  CNAE:1;                                         /* CNAE             */
    uint8  SFBME:1;                                        /* SFBME            */
    uint8  SFOE:1;                                         /* SFOE             */
    uint8  CCFE:1;                                         /* CCFE             */
    uint8  CCLE:1;                                         /* CCLE             */
    uint8  AERRE:1;                                        /* AERRE            */
    uint8  RFOE:1;                                         /* RFOE             */
    uint8  EFAE:1;                                         /* EFAE             */
    uint8  IIBAE:1;                                        /* IIBAE            */
    uint8  IOBAE:1;                                        /* IOBAE            */
    uint8  MHFE:1;                                         /* MHFE             */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  EDAE:1;                                         /* EDAE             */
    uint8  LTVAE:1;                                        /* LTVAE            */
    uint8  TABAE:1;                                        /* TABAE            */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  EDBE:1;                                         /* EDBE             */
    uint8  LTVBE:1;                                        /* LTVBE            */
    uint8  TABBE:1;                                        /* TABBE            */
    uint8  :5;                                             /* Reserved Bits    */
} __type7;
typedef struct 
{                                                          /* Bit Access       */
    uint8  PEMCD:1;                                        /* PEMCD            */
    uint8  CNAD:1;                                         /* CNAD             */
    uint8  SFBMD:1;                                        /* SFBMD            */
    uint8  SFOD:1;                                         /* SFOD             */
    uint8  CCFD:1;                                         /* CCFD             */
    uint8  CCLD:1;                                         /* CCLD             */
    uint8  AERRD:1;                                        /* AERRD            */
    uint8  RFOD:1;                                         /* RFOD             */
    uint8  EFAD:1;                                         /* EFAD             */
    uint8  IIBAD:1;                                        /* IIBAD            */
    uint8  IOBAD:1;                                        /* IOBAD            */
    uint8  MHFD:1;                                         /* MHFD             */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  EDAD:1;                                         /* EDAD             */
    uint8  LTVAD:1;                                        /* LTVAD            */
    uint8  TABAD:1;                                        /* TABAD            */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  EDBD:1;                                         /* EDBD             */
    uint8  LTVBD:1;                                        /* LTVBD            */
    uint8  TABBD:1;                                        /* TABBD            */
    uint8  :5;                                             /* Reserved Bits    */
} __type8;
typedef struct 
{                                                          /* Bit Access       */
    uint8  WSTE:1;                                         /* WSTE             */
    uint8  CASE:1;                                         /* CASE             */
    uint8  CYCSE:1;                                        /* CYCSE            */
    uint8  TXIE:1;                                         /* TXIE             */
    uint8  RXIE:1;                                         /* RXIE             */
    uint8  RFNEE:1;                                        /* RFNEE            */
    uint8  RFCLE:1;                                        /* RFCLE            */
    uint8  NMVCE:1;                                        /* NMVCE            */
    uint8  TI0E:1;                                         /* TI0E             */
    uint8  TI1E:1;                                         /* TI1E             */
    uint8  TIBCE:1;                                        /* TIBCE            */
    uint8  TOBCE:1;                                        /* TOBCE            */
    uint8  SWEE:1;                                         /* SWEE             */
    uint8  SUCSE:1;                                        /* SUCSE            */
    uint8  MBSIE:1;                                        /* MBSIE            */
    uint8  SDSE:1;                                         /* SDSE             */
    uint8  WUPAE:1;                                        /* WUPAE            */
    uint8  MTSAE:1;                                        /* MTSAE            */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  WUPBE:1;                                        /* WUPBE            */
    uint8  MTSBE:1;                                        /* MTSBE            */
    uint8  :6;                                             /* Reserved Bits    */
} __type9;
typedef struct 
{                                                          /* Bit Access       */
    uint8  WSTD:1;                                         /* WSTD             */
    uint8  CASD:1;                                         /* CASD             */
    uint8  CYCSD:1;                                        /* CYCSD            */
    uint8  TXID:1;                                         /* TXID             */
    uint8  RXID:1;                                         /* RXID             */
    uint8  RFNED:1;                                        /* RFNED            */
    uint8  RFCLD:1;                                        /* RFCLD            */
    uint8  NMVCD:1;                                        /* NMVCD            */
    uint8  TI0D:1;                                         /* TI0D             */
    uint8  TI1D:1;                                         /* TI1D             */
    uint8  TIBCD:1;                                        /* TIBCD            */
    uint8  TOBCD:1;                                        /* TOBCD            */
    uint8  SWED:1;                                         /* SWED             */
    uint8  SUCSD:1;                                        /* SUCSD            */
    uint8  MBSID:1;                                        /* MBSID            */
    uint8  SDSD:1;                                         /* SDSD             */
    uint8  WUPAD:1;                                        /* WUPAD            */
    uint8  MTSAD:1;                                        /* MTSAD            */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  WUPBD:1;                                        /* WUPBD            */
    uint8  MTSBD:1;                                        /* MTSBD            */
    uint8  :6;                                             /* Reserved Bits    */
} __type10;
typedef struct 
{                                                          /* Bit Access       */
    uint8  EINT0:1;                                        /* EINT0            */
    uint8  EINT1:1;                                        /* EINT1            */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type11;
typedef struct 
{                                                          /* Bit Access       */
    uint8  T0RC:1;                                         /* T0RC             */
    uint8  T0MS:1;                                         /* T0MS             */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  T0CC:7;                                         /* T0CC[14:8]       */
    uint8  :1;                                             /* Reserved Bits    */
    uint16 T0MO:14;                                        /* T0MO[29:16]      */
    uint8  :2;                                             /* Reserved Bits    */
} __type12;
typedef struct 
{                                                          /* Bit Access       */
    uint8  T1RC:1;                                         /* T1RC             */
    uint8  T1MS:1;                                         /* T1MS             */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint16 T1MC:14;                                        /* T1MC[29:16]      */
    uint8  :2;                                             /* Reserved Bits    */
} __type13;
typedef struct 
{                                                          /* Bit Access       */
    uint8  ESWT:1;                                         /* ESWT             */
    uint8  SWMS:1;                                         /* SWMS             */
    uint8  EDGE:1;                                         /* EDGE             */
    uint8  SSWT:1;                                         /* SSWT             */
    uint8  EETP:1;                                         /* EETP             */
    uint8  EINT0:1;                                        /* EINT0            */
    uint8  EINT1:1;                                        /* EINT1            */
    uint8  :1;                                             /* Reserved Bits    */
    const uint8  SCCV:6;                                   /* SCCV[13:8]       */
    uint8  :2;                                             /* Reserved Bits    */
    const uint16 SMTV:14;                                  /* SMTV[29:16]      */
    uint8  :2;                                             /* Reserved Bits    */
} __type14;
typedef struct 
{                                                          /* Bit Access       */
    const uint16 SSCVA:11;                                 /* SSCVA[10:0]      */
    uint8  :5;                                             /* Reserved Bits    */
    const uint16 SSCVB:11;                                 /* SSCVB[26:16]     */
    uint8  :5;                                             /* Reserved Bits    */
} __type15;
typedef struct 
{                                                          /* Bit Access       */
    uint8  CMD:4;                                          /* CMD[3:0]         */
    uint8  :3;                                             /* Reserved Bits    */
    const uint8  PBSY:1;                                   /* PBSY             */
    uint8  TXST:1;                                         /* TXST             */
    uint8  TXSY:1;                                         /* TXSY             */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  CSA:5;                                          /* CSA[15:11]       */
    uint8  PTA:5;                                          /* PTA[20:16]       */
    uint8  WUCS:1;                                         /* WUCS             */
    uint8  TSM:1;                                          /* TSM              */
    uint8  HCSE:1;                                         /* HCSE             */
    uint8  MTSA:1;                                         /* MTSA             */
    uint8  MTSB:1;                                         /* MTSB             */
    uint8  CCHA:1;                                         /* CCHA             */
    uint8  CCHB:1;                                         /* CCHB             */
    uint8  :4;                                             /* Reserved Bits    */
} __type16;
typedef struct 
{                                                          /* Bit Access       */
    uint32 LT:21;                                          /* LT[20:0]         */
    uint8  :3;                                             /* Reserved Bits    */
    uint8  LTN:4;                                          /* LTN[27:24]       */
    uint8  :4;                                             /* Reserved Bits    */
} __type17;
typedef struct 
{                                                          /* Bit Access       */
    uint8  WCP:4;                                          /* WCP[3:0]         */
    uint8  WCF:4;                                          /* WCF[7:4]         */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type18;
typedef struct 
{                                                          /* Bit Access       */
    uint8  NML:4;                                          /* NML[3:0]         */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type19;
typedef struct 
{                                                          /* Bit Access       */
    uint8  TSST:4;                                         /* TSST[3:0]        */
    uint16 CASM:7;                                         /* CASM[10:4]       */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  SPP:2;                                          /* SPP[13:12]       */
    uint8  BRP:2;                                          /* BRP[15:14]       */
    uint16 RXW:9;                                          /* RXW[24:16]       */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  RWP:6;                                          /* RWP[31:26]       */
} __type20;
typedef struct 
{                                                          /* Bit Access       */
    uint8  RXI:6;                                          /* RXI[5:0]         */
    uint8  :2;                                             /* Reserved Bits    */
    uint8  RXL:6;                                          /* RXL[13:8]        */
    uint8  :2;                                             /* Reserved Bits    */
    uint8  TXI:8;                                          /* TXI[23:16]       */
    uint8  TXL:6;                                          /* TXL[29:24]       */
    uint8  :2;                                             /* Reserved Bits    */
} __type21;
typedef struct 
{                                                          /* Bit Access       */
    uint8  SFDL:7;                                         /* SFDL[6:0]        */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint16 SLT:13;                                         /* SLT[28:16]       */
    uint8  :3;                                             /* Reserved Bits    */
} __type22;
typedef struct 
{                                                          /* Bit Access       */
    uint32 UT:20;                                          /* UT[19:0]         */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type23;
typedef struct 
{                                                          /* Bit Access       */
    uint16 MPC:14;                                         /* MPC[13:0]        */
    uint8  :2;                                             /* Reserved Bits    */
    uint8  SNM:4;                                          /* SNM[19:16]       */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type24;
typedef struct 
{                                                          /* Bit Access       */
    uint8  UIOA:8;                                         /* UIOA[7:0]        */
    uint8  UIOB:8;                                         /* UIOB[15:8]       */
    uint8  MIOA:7;                                         /* MIOA[22:16]      */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  MIOB:7;                                         /* MIOB[30:24]      */
    uint8  :1;                                             /* Reserved Bits    */
} __type25;
typedef struct 
{                                                          /* Bit Access       */
    uint16 NIT:14;                                         /* NIT[13:0]        */
    uint8  :2;                                             /* Reserved Bits    */
    uint16 OCS:14;                                         /* OCS[29:16]       */
    uint8  :2;                                             /* Reserved Bits    */
} __type26;
typedef struct 
{                                                          /* Bit Access       */
    uint8  DCA:8;                                          /* DCA[7:0]         */
    uint8  DCB:8;                                          /* DCB[15:8]        */
    uint8  CDD:5;                                          /* CDD[20:16]       */
    uint8  :3;                                             /* Reserved Bits    */
    uint8  DEC:8;                                          /* DEC[31:24]       */
} __type27;
typedef struct 
{                                                          /* Bit Access       */
    uint16 ASR:11;                                         /* ASR[10:0]        */
    uint8  :5;                                             /* Reserved Bits    */
    uint16 MOD:11;                                         /* MOD[26:16]       */
    uint8  :5;                                             /* Reserved Bits    */
} __type28;
typedef struct 
{                                                          /* Bit Access       */
    uint16 SSL:10;                                         /* SSL[9:0]         */
    uint8  :6;                                             /* Reserved Bits    */
    uint16 NSS:10;                                         /* NSS[25:16]       */
    uint8  :6;                                             /* Reserved Bits    */
} __type29;
typedef struct 
{                                                          /* Bit Access       */
    uint8  MSL:6;                                          /* MSL[5:0]         */
    uint8  :2;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint16 NMS:13;                                         /* NMS[28:16]       */
    uint8  :3;                                             /* Reserved Bits    */
} __type30;
typedef struct 
{                                                          /* Bit Access       */
    uint8  APO:6;                                          /* APO[5:0]         */
    uint8  :2;                                             /* Reserved Bits    */
    uint8  MAPO:5;                                         /* MAPO[12:8]       */
    uint8  :3;                                             /* Reserved Bits    */
    uint8  DSI:2;                                          /* DSI[17:16]       */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type31;
typedef struct 
{                                                          /* Bit Access       */
    uint16 MOC:14;                                         /* MOC[13:0]        */
    uint8  :2;                                             /* Reserved Bits    */
    uint16 MRC:11;                                         /* MRC[26:16]       */
    uint8  :5;                                             /* Reserved Bits    */
} __type32;
typedef struct 
{                                                          /* Bit Access       */
    uint8  EOCC:2;                                         /* EOCC[1:0]        */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  ERCC:2;                                         /* ERCC[9:8]        */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  EOC:3;                                          /* EOC[18:16]       */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  ERC:3;                                          /* ERC[26:24]       */
    uint8  :5;                                             /* Reserved Bits    */
} __type33;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  POCS:6;                                   /* POCS[5:0]        */
    const uint8  FSI:1;                                    /* FSI              */
    const uint8  HRQ:1;                                    /* HRQ              */
    const uint8  SLM:2;                                    /* SLM[9:8]         */
    uint8  :2;                                             /* Reserved Bits    */
    const uint8  CSNI:1;                                   /* CSNI             */
    const uint8  CSAI:1;                                   /* CSAI             */
    const uint8  CSI:1;                                    /* CSI              */
    uint8  :1;                                             /* Reserved Bits    */
    const uint8  WSV:3;                                    /* WSV[18:16]       */
    const uint8  RCA:5;                                    /* RCA[23:19]       */
    const uint8  PSL:6;                                    /* PSL[29:24]       */
    uint8  :2;                                             /* Reserved Bits    */
} __type34;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  CCFC:4;                                   /* CCFC[3:0]        */
    uint8  :2;                                             /* Reserved Bits    */
    const uint8  ERRM:2;                                   /* ERRM[7:6]        */
    const uint8  PTAC:5;                                   /* PTAC[12:8]       */
    uint8  :3;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type35;
typedef struct 
{                                                          /* Bit Access       */
    const uint16 SCCA:11;                                  /* SCCA[10:0]       */
    uint8  :5;                                             /* Reserved Bits    */
    const uint16 SCCB:11;                                  /* SCCB[26:16]      */
    uint8  :5;                                             /* Reserved Bits    */
} __type36;
typedef struct 
{                                                          /* Bit Access       */
    const uint16 MTV:14;                                   /* MTV[13:0]        */
    uint8  :2;                                             /* Reserved Bits    */
    const uint8  CCV:6;                                    /* CCV[21:16]       */
    uint8  :2;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type37;
typedef struct 
{                                                          /* Bit Access       */
    const uint16 RCV:12;                                   /* RCV[11:0]        */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type38;
typedef struct 
{                                                          /* Bit Access       */
    const uint32 OCV:19;                                   /* OCV[18:0]        */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type39;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  VSAE:4;                                   /* VSAE[3:0]        */
    const uint8  VSAO:4;                                   /* VSAO[7:4]        */
    const uint8  VSBE:4;                                   /* VSBE[11:8]       */
    const uint8  VSBO:4;                                   /* VSBO[15:12]      */
    const uint8  MOCS:1;                                   /* MOCS             */
    const uint8  OCLR:1;                                   /* OCLR             */
    const uint8  MRCS:1;                                   /* MRCS             */
    const uint8  RCLR:1;                                   /* RCLR             */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type40;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  SESA:1;                                   /* SESA             */
    const uint8  SBSA:1;                                   /* SBSA             */
    const uint8  TCSA:1;                                   /* TCSA             */
    const uint8  SESB:1;                                   /* SESB             */
    const uint8  SBSB:1;                                   /* SBSB             */
    const uint8  TCSB:1;                                   /* TCSB             */
    const uint8  MTSA:1;                                   /* MTSA             */
    const uint8  MTSB:1;                                   /* MTSB             */
    const uint8  SENA:1;                                   /* SENA             */
    const uint8  SBNA:1;                                   /* SBNA             */
    const uint8  SENB:1;                                   /* SENB             */
    const uint8  SBNB:1;                                   /* SBNB             */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type41;
typedef struct 
{                                                          /* Bit Access       */
    uint8  VFRA:1;                                         /* VFRA             */
    uint8  SEDA:1;                                         /* SEDA             */
    uint8  CEDA:1;                                         /* CEDA             */
    uint8  CIA:1;                                          /* CIA              */
    uint8  SBVA:1;                                         /* SBVA             */
    uint8  :3;                                             /* Reserved Bits    */
    uint8  VFRB:1;                                         /* VFRB             */
    uint8  SEDB:1;                                         /* SEDB             */
    uint8  CEDB:1;                                         /* CEDB             */
    uint8  CIB:1;                                          /* CIB              */
    uint8  SBVB:1;                                         /* SBVB             */
    uint8  :3;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type42;
typedef struct 
{                                                          /* Bit Access       */
    const uint16 EID:10;                                   /* EID[9:0]         */
    uint8  :4;                                             /* Reserved Bits    */
    const uint8  RXEA:1;                                   /* RXEA             */
    const uint8  RXEB:1;                                   /* RXEB             */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type43;
typedef struct 
{                                                          /* Bit Access       */
    const uint16 OID:10;                                   /* OID[9:0]         */
    uint8  :4;                                             /* Reserved Bits    */
    const uint8  RXOA:1;                                   /* RXOA             */
    const uint8  RXOB:1;                                   /* RXOB             */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type44;
typedef struct 
{                                                          /* Bit Access       */
    const uint32 NM:32;                                    /* NM[31:0]         */
} __type45;
typedef struct 
{                                                          /* Bit Access       */
    uint8  FDB:8;                                          /* FDB[7:0]         */
    uint8  FFB:8;                                          /* FFB[15:8]        */
    uint8  LCB:8;                                          /* LCB[23:16]       */
    uint8  SEC:2;                                          /* SEC[25:24]       */
    uint8  SPLM:1;                                         /* SPLM             */
    uint8  :5;                                             /* Reserved Bits    */
} __type46;
typedef struct 
{                                                          /* Bit Access       */
    uint8  CH:2;                                           /* CH[1:0]          */
    uint16 FID:11;                                         /* FID[12:2]        */
    uint8  :3;                                             /* Reserved Bits    */
    uint8  CYF:7;                                          /* CYF[22:16]       */
    uint8  RSS:1;                                          /* RSS              */
    uint8  RNF:1;                                          /* RNF              */
    uint8  :7;                                             /* Reserved Bits    */
} __type47;
typedef struct 
{                                                          /* Bit Access       */
    uint8  :2;                                             /* Reserved Bits    */
    uint16 MFID:11;                                        /* MFID[12:2]       */
    uint8  :3;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type48;
typedef struct 
{                                                          /* Bit Access       */
    uint8  CL:8;                                           /* CL[7:0]          */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type49;
typedef struct 
{                                                          /* Bit Access       */
    uint8  :2;                                             /* Reserved Bits    */
    uint8  AMR:1;                                          /* AMR              */
    uint8  ATBF1:1;                                        /* ATBF1            */
    uint8  ATBF2:1;                                        /* ATBF2            */
    uint8  FMBD:1;                                         /* FMBD             */
    uint8  MFMB:1;                                         /* MFMB             */
    const uint8  CRAM:1;                                   /* CRAM             */
    const uint8  FMB:7;                                    /* FMB[14:8]        */
    uint8  :1;                                             /* Reserved Bits    */
    const uint8  MBT:7;                                    /* MBT[22:16]       */
    uint8  :1;                                             /* Reserved Bits    */
    const uint8  MBU:7;                                    /* MBU[30:24]       */
    uint8  :1;                                             /* Reserved Bits    */
} __type50;
typedef struct 
{                                                          /* Bit Access       */
    const uint16 LDTA:11;                                  /* LDTA[10:0]       */
    uint8  :5;                                             /* Reserved Bits    */
    const uint16 LDTB:11;                                  /* LDTB[26:16]      */
    uint8  :5;                                             /* Reserved Bits    */
} __type51;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  RFNE:1;                                   /* RFNE             */
    const uint8  RFCL:1;                                   /* RFCL             */
    const uint8  RFO:1;                                    /* RFO              */
    uint8  :5;                                             /* Reserved Bits    */
    const uint8  RFFL:8;                                   /* RFFL[15:8]       */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type52;
typedef struct 
{                                                          /* Bit Access       */
    uint8  SNUA:1;                                         /* SNUA             */
    uint8  SNUB:1;                                         /* SNUB             */
    uint8  FNFA:1;                                         /* FNFA             */
    uint8  FNFB:1;                                         /* FNFB             */
    uint8  TBFA:1;                                         /* TBFA             */
    uint8  TBFB:1;                                         /* TBFB             */
    uint8  TNSA:1;                                         /* TNSA             */
    uint8  TNSB:1;                                         /* TNSB             */
    uint8  WAHP:1;                                         /* WAHP             */
    uint8  :7;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type53;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  TXR0:1;                                   /* TXR0             */
    const uint8  TXR1:1;                                   /* TXR1             */
    const uint8  TXR2:1;                                   /* TXR2             */
    const uint8  TXR3:1;                                   /* TXR3             */
    const uint8  TXR4:1;                                   /* TXR4             */
    const uint8  TXR5:1;                                   /* TXR5             */
    const uint8  TXR6:1;                                   /* TXR6             */
    const uint8  TXR7:1;                                   /* TXR7             */
    const uint8  TXR8:1;                                   /* TXR8             */
    const uint8  TXR9:1;                                   /* TXR9             */
    const uint8  TXR10:1;                                  /* TXR10            */
    const uint8  TXR11:1;                                  /* TXR11            */
    const uint8  TXR12:1;                                  /* TXR12            */
    const uint8  TXR13:1;                                  /* TXR13            */
    const uint8  TXR14:1;                                  /* TXR14            */
    const uint8  TXR15:1;                                  /* TXR15            */
    const uint8  TXR16:1;                                  /* TXR16            */
    const uint8  TXR17:1;                                  /* TXR17            */
    const uint8  TXR18:1;                                  /* TXR18            */
    const uint8  TXR19:1;                                  /* TXR19            */
    const uint8  TXR20:1;                                  /* TXR20            */
    const uint8  TXR21:1;                                  /* TXR21            */
    const uint8  TXR22:1;                                  /* TXR22            */
    const uint8  TXR23:1;                                  /* TXR23            */
    const uint8  TXR24:1;                                  /* TXR24            */
    const uint8  TXR25:1;                                  /* TXR25            */
    const uint8  TXR26:1;                                  /* TXR26            */
    const uint8  TXR27:1;                                  /* TXR27            */
    const uint8  TXR28:1;                                  /* TXR28            */
    const uint8  TXR29:1;                                  /* TXR29            */
    const uint8  TXR30:1;                                  /* TXR30            */
    const uint8  TXR31:1;                                  /* TXR31            */
} __type54;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  TXR32:1;                                  /* TXR32            */
    const uint8  TXR33:1;                                  /* TXR33            */
    const uint8  TXR34:1;                                  /* TXR34            */
    const uint8  TXR35:1;                                  /* TXR35            */
    const uint8  TXR36:1;                                  /* TXR36            */
    const uint8  TXR37:1;                                  /* TXR37            */
    const uint8  TXR38:1;                                  /* TXR38            */
    const uint8  TXR39:1;                                  /* TXR39            */
    const uint8  TXR40:1;                                  /* TXR40            */
    const uint8  TXR41:1;                                  /* TXR41            */
    const uint8  TXR42:1;                                  /* TXR42            */
    const uint8  TXR43:1;                                  /* TXR43            */
    const uint8  TXR44:1;                                  /* TXR44            */
    const uint8  TXR45:1;                                  /* TXR45            */
    const uint8  TXR46:1;                                  /* TXR46            */
    const uint8  TXR47:1;                                  /* TXR47            */
    const uint8  TXR48:1;                                  /* TXR48            */
    const uint8  TXR49:1;                                  /* TXR49            */
    const uint8  TXR50:1;                                  /* TXR50            */
    const uint8  TXR51:1;                                  /* TXR51            */
    const uint8  TXR52:1;                                  /* TXR52            */
    const uint8  TXR53:1;                                  /* TXR53            */
    const uint8  TXR54:1;                                  /* TXR54            */
    const uint8  TXR55:1;                                  /* TXR55            */
    const uint8  TXR56:1;                                  /* TXR56            */
    const uint8  TXR57:1;                                  /* TXR57            */
    const uint8  TXR58:1;                                  /* TXR58            */
    const uint8  TXR59:1;                                  /* TXR59            */
    const uint8  TXR60:1;                                  /* TXR60            */
    const uint8  TXR61:1;                                  /* TXR61            */
    const uint8  TXR62:1;                                  /* TXR62            */
    const uint8  TXR63:1;                                  /* TXR63            */
} __type55;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  TXR64:1;                                  /* TXR64            */
    const uint8  TXR65:1;                                  /* TXR65            */
    const uint8  TXR66:1;                                  /* TXR66            */
    const uint8  TXR67:1;                                  /* TXR67            */
    const uint8  TXR68:1;                                  /* TXR68            */
    const uint8  TXR69:1;                                  /* TXR69            */
    const uint8  TXR70:1;                                  /* TXR70            */
    const uint8  TXR71:1;                                  /* TXR71            */
    const uint8  TXR72:1;                                  /* TXR72            */
    const uint8  TXR73:1;                                  /* TXR73            */
    const uint8  TXR74:1;                                  /* TXR74            */
    const uint8  TXR75:1;                                  /* TXR75            */
    const uint8  TXR76:1;                                  /* TXR76            */
    const uint8  TXR77:1;                                  /* TXR77            */
    const uint8  TXR78:1;                                  /* TXR78            */
    const uint8  TXR79:1;                                  /* TXR79            */
    const uint8  TXR80:1;                                  /* TXR80            */
    const uint8  TXR81:1;                                  /* TXR81            */
    const uint8  TXR82:1;                                  /* TXR82            */
    const uint8  TXR83:1;                                  /* TXR83            */
    const uint8  TXR84:1;                                  /* TXR84            */
    const uint8  TXR85:1;                                  /* TXR85            */
    const uint8  TXR86:1;                                  /* TXR86            */
    const uint8  TXR87:1;                                  /* TXR87            */
    const uint8  TXR88:1;                                  /* TXR88            */
    const uint8  TXR89:1;                                  /* TXR89            */
    const uint8  TXR90:1;                                  /* TXR90            */
    const uint8  TXR91:1;                                  /* TXR91            */
    const uint8  TXR92:1;                                  /* TXR92            */
    const uint8  TXR93:1;                                  /* TXR93            */
    const uint8  TXR94:1;                                  /* TXR94            */
    const uint8  TXR95:1;                                  /* TXR95            */
} __type56;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  TXR96:1;                                  /* TXR96            */
    const uint8  TXR97:1;                                  /* TXR97            */
    const uint8  TXR98:1;                                  /* TXR98            */
    const uint8  TXR99:1;                                  /* TXR99            */
    const uint8  TXR100:1;                                 /* TXR100           */
    const uint8  TXR101:1;                                 /* TXR101           */
    const uint8  TXR102:1;                                 /* TXR102           */
    const uint8  TXR103:1;                                 /* TXR103           */
    const uint8  TXR104:1;                                 /* TXR104           */
    const uint8  TXR105:1;                                 /* TXR105           */
    const uint8  TXR106:1;                                 /* TXR106           */
    const uint8  TXR107:1;                                 /* TXR107           */
    const uint8  TXR108:1;                                 /* TXR108           */
    const uint8  TXR109:1;                                 /* TXR109           */
    const uint8  TXR110:1;                                 /* TXR110           */
    const uint8  TXR111:1;                                 /* TXR111           */
    const uint8  TXR112:1;                                 /* TXR112           */
    const uint8  TXR113:1;                                 /* TXR113           */
    const uint8  TXR114:1;                                 /* TXR114           */
    const uint8  TXR115:1;                                 /* TXR115           */
    const uint8  TXR116:1;                                 /* TXR116           */
    const uint8  TXR117:1;                                 /* TXR117           */
    const uint8  TXR118:1;                                 /* TXR118           */
    const uint8  TXR119:1;                                 /* TXR119           */
    const uint8  TXR120:1;                                 /* TXR120           */
    const uint8  TXR121:1;                                 /* TXR121           */
    const uint8  TXR122:1;                                 /* TXR122           */
    const uint8  TXR123:1;                                 /* TXR123           */
    const uint8  TXR124:1;                                 /* TXR124           */
    const uint8  TXR125:1;                                 /* TXR125           */
    const uint8  TXR126:1;                                 /* TXR126           */
    const uint8  TXR127:1;                                 /* TXR127           */
} __type57;
typedef struct 
{                                                          /* Bit Access       */
    uint8  ND0:1;                                          /* ND0              */
    uint8  ND1:1;                                          /* ND1              */
    uint8  ND2:1;                                          /* ND2              */
    uint8  ND3:1;                                          /* ND3              */
    uint8  ND4:1;                                          /* ND4              */
    uint8  ND5:1;                                          /* ND5              */
    uint8  ND6:1;                                          /* ND6              */
    uint8  ND7:1;                                          /* ND7              */
    uint8  ND8:1;                                          /* ND8              */
    uint8  ND9:1;                                          /* ND9              */
    uint8  ND10:1;                                         /* ND10             */
    uint8  ND11:1;                                         /* ND11             */
    uint8  ND12:1;                                         /* ND12             */
    uint8  ND13:1;                                         /* ND13             */
    uint8  ND14:1;                                         /* ND14             */
    uint8  ND15:1;                                         /* ND15             */
    uint8  ND16:1;                                         /* ND16             */
    uint8  ND17:1;                                         /* ND17             */
    uint8  ND18:1;                                         /* ND18             */
    uint8  ND19:1;                                         /* ND19             */
    uint8  ND20:1;                                         /* ND20             */
    uint8  ND21:1;                                         /* ND21             */
    uint8  ND22:1;                                         /* ND22             */
    uint8  ND23:1;                                         /* ND23             */
    uint8  ND24:1;                                         /* ND24             */
    uint8  ND25:1;                                         /* ND25             */
    uint8  ND26:1;                                         /* ND26             */
    uint8  ND27:1;                                         /* ND27             */
    uint8  ND28:1;                                         /* ND28             */
    uint8  ND29:1;                                         /* ND29             */
    uint8  ND30:1;                                         /* ND30             */
    uint8  ND31:1;                                         /* ND31             */
} __type58;
typedef struct 
{                                                          /* Bit Access       */
    uint8  ND32:1;                                         /* ND32             */
    uint8  ND33:1;                                         /* ND33             */
    uint8  ND34:1;                                         /* ND34             */
    uint8  ND35:1;                                         /* ND35             */
    uint8  ND36:1;                                         /* ND36             */
    uint8  ND37:1;                                         /* ND37             */
    uint8  ND38:1;                                         /* ND38             */
    uint8  ND39:1;                                         /* ND39             */
    uint8  ND40:1;                                         /* ND40             */
    uint8  ND41:1;                                         /* ND41             */
    uint8  ND42:1;                                         /* ND42             */
    uint8  ND43:1;                                         /* ND43             */
    uint8  ND44:1;                                         /* ND44             */
    uint8  ND45:1;                                         /* ND45             */
    uint8  ND46:1;                                         /* ND46             */
    uint8  ND47:1;                                         /* ND47             */
    uint8  ND48:1;                                         /* ND48             */
    uint8  ND49:1;                                         /* ND49             */
    uint8  ND50:1;                                         /* ND50             */
    uint8  ND51:1;                                         /* ND51             */
    uint8  ND52:1;                                         /* ND52             */
    uint8  ND53:1;                                         /* ND53             */
    uint8  ND54:1;                                         /* ND54             */
    uint8  ND55:1;                                         /* ND55             */
    uint8  ND56:1;                                         /* ND56             */
    uint8  ND57:1;                                         /* ND57             */
    uint8  ND58:1;                                         /* ND58             */
    uint8  ND59:1;                                         /* ND59             */
    uint8  ND60:1;                                         /* ND60             */
    uint8  ND61:1;                                         /* ND61             */
    uint8  ND62:1;                                         /* ND62             */
    uint8  ND63:1;                                         /* ND63             */
} __type59;
typedef struct 
{                                                          /* Bit Access       */
    uint8  ND64:1;                                         /* ND64             */
    uint8  ND65:1;                                         /* ND65             */
    uint8  ND66:1;                                         /* ND66             */
    uint8  ND67:1;                                         /* ND67             */
    uint8  ND68:1;                                         /* ND68             */
    uint8  ND69:1;                                         /* ND69             */
    uint8  ND70:1;                                         /* ND70             */
    uint8  ND71:1;                                         /* ND71             */
    uint8  ND72:1;                                         /* ND72             */
    uint8  ND73:1;                                         /* ND73             */
    uint8  ND74:1;                                         /* ND74             */
    uint8  ND75:1;                                         /* ND75             */
    uint8  ND76:1;                                         /* ND76             */
    uint8  ND77:1;                                         /* ND77             */
    uint8  ND78:1;                                         /* ND78             */
    uint8  ND79:1;                                         /* ND79             */
    uint8  ND80:1;                                         /* ND80             */
    uint8  ND81:1;                                         /* ND81             */
    uint8  ND82:1;                                         /* ND82             */
    uint8  ND83:1;                                         /* ND83             */
    uint8  ND84:1;                                         /* ND84             */
    uint8  ND85:1;                                         /* ND85             */
    uint8  ND86:1;                                         /* ND86             */
    uint8  ND87:1;                                         /* ND87             */
    uint8  ND88:1;                                         /* ND88             */
    uint8  ND89:1;                                         /* ND89             */
    uint8  ND90:1;                                         /* ND90             */
    uint8  ND91:1;                                         /* ND91             */
    uint8  ND92:1;                                         /* ND92             */
    uint8  ND93:1;                                         /* ND93             */
    uint8  ND94:1;                                         /* ND94             */
    uint8  ND95:1;                                         /* ND95             */
} __type60;
typedef struct 
{                                                          /* Bit Access       */
    uint8  ND96:1;                                         /* ND96             */
    uint8  ND97:1;                                         /* ND97             */
    uint8  ND98:1;                                         /* ND98             */
    uint8  ND99:1;                                         /* ND99             */
    uint8  ND100:1;                                        /* ND100            */
    uint8  ND101:1;                                        /* ND101            */
    uint8  ND102:1;                                        /* ND102            */
    uint8  ND103:1;                                        /* ND103            */
    uint8  ND104:1;                                        /* ND104            */
    uint8  ND105:1;                                        /* ND105            */
    uint8  ND106:1;                                        /* ND106            */
    uint8  ND107:1;                                        /* ND107            */
    uint8  ND108:1;                                        /* ND108            */
    uint8  ND109:1;                                        /* ND109            */
    uint8  ND110:1;                                        /* ND110            */
    uint8  ND111:1;                                        /* ND111            */
    uint8  ND112:1;                                        /* ND112            */
    uint8  ND113:1;                                        /* ND113            */
    uint8  ND114:1;                                        /* ND114            */
    uint8  ND115:1;                                        /* ND115            */
    uint8  ND116:1;                                        /* ND116            */
    uint8  ND117:1;                                        /* ND117            */
    uint8  ND118:1;                                        /* ND118            */
    uint8  ND119:1;                                        /* ND119            */
    uint8  ND120:1;                                        /* ND120            */
    uint8  ND121:1;                                        /* ND121            */
    uint8  ND122:1;                                        /* ND122            */
    uint8  ND123:1;                                        /* ND123            */
    uint8  ND124:1;                                        /* ND124            */
    uint8  ND125:1;                                        /* ND125            */
    uint8  ND126:1;                                        /* ND126            */
    uint8  ND127:1;                                        /* ND127            */
} __type61;
typedef struct 
{                                                          /* Bit Access       */
    uint8  MBC0:1;                                         /* MBC0             */
    uint8  MBC1:1;                                         /* MBC1             */
    uint8  MBC2:1;                                         /* MBC2             */
    uint8  MBC3:1;                                         /* MBC3             */
    uint8  MBC4:1;                                         /* MBC4             */
    uint8  MBC5:1;                                         /* MBC5             */
    uint8  MBC6:1;                                         /* MBC6             */
    uint8  MBC7:1;                                         /* MBC7             */
    uint8  MBC8:1;                                         /* MBC8             */
    uint8  MBC9:1;                                         /* MBC9             */
    uint8  MBC10:1;                                        /* MBC10            */
    uint8  MBC11:1;                                        /* MBC11            */
    uint8  MBC12:1;                                        /* MBC12            */
    uint8  MBC13:1;                                        /* MBC13            */
    uint8  MBC14:1;                                        /* MBC14            */
    uint8  MBC15:1;                                        /* MBC15            */
    uint8  MBC16:1;                                        /* MBC16            */
    uint8  MBC17:1;                                        /* MBC17            */
    uint8  MBC18:1;                                        /* MBC18            */
    uint8  MBC19:1;                                        /* MBC19            */
    uint8  MBC20:1;                                        /* MBC20            */
    uint8  MBC21:1;                                        /* MBC21            */
    uint8  MBC22:1;                                        /* MBC22            */
    uint8  MBC23:1;                                        /* MBC23            */
    uint8  MBC24:1;                                        /* MBC24            */
    uint8  MBC25:1;                                        /* MBC25            */
    uint8  MBC26:1;                                        /* MBC26            */
    uint8  MBC27:1;                                        /* MBC27            */
    uint8  MBC28:1;                                        /* MBC28            */
    uint8  MBC29:1;                                        /* MBC29            */
    uint8  MBC30:1;                                        /* MBC30            */
    uint8  MBC31:1;                                        /* MBC31            */
} __type62;
typedef struct 
{                                                          /* Bit Access       */
    uint8  MBC32:1;                                        /* MBC32            */
    uint8  MBC33:1;                                        /* MBC33            */
    uint8  MBC34:1;                                        /* MBC34            */
    uint8  MBC35:1;                                        /* MBC35            */
    uint8  MBC36:1;                                        /* MBC36            */
    uint8  MBC37:1;                                        /* MBC37            */
    uint8  MBC38:1;                                        /* MBC38            */
    uint8  MBC39:1;                                        /* MBC39            */
    uint8  MBC40:1;                                        /* MBC40            */
    uint8  MBC41:1;                                        /* MBC41            */
    uint8  MBC42:1;                                        /* MBC42            */
    uint8  MBC43:1;                                        /* MBC43            */
    uint8  MBC44:1;                                        /* MBC44            */
    uint8  MBC45:1;                                        /* MBC45            */
    uint8  MBC46:1;                                        /* MBC46            */
    uint8  MBC47:1;                                        /* MBC47            */
    uint8  MBC48:1;                                        /* MBC48            */
    uint8  MBC49:1;                                        /* MBC49            */
    uint8  MBC50:1;                                        /* MBC50            */
    uint8  MBC51:1;                                        /* MBC51            */
    uint8  MBC52:1;                                        /* MBC52            */
    uint8  MBC53:1;                                        /* MBC53            */
    uint8  MBC54:1;                                        /* MBC54            */
    uint8  MBC55:1;                                        /* MBC55            */
    uint8  MBC56:1;                                        /* MBC56            */
    uint8  MBC57:1;                                        /* MBC57            */
    uint8  MBC58:1;                                        /* MBC58            */
    uint8  MBC59:1;                                        /* MBC59            */
    uint8  MBC60:1;                                        /* MBC60            */
    uint8  MBC61:1;                                        /* MBC61            */
    uint8  MBC62:1;                                        /* MBC62            */
    uint8  MBC63:1;                                        /* MBC63            */
} __type63;
typedef struct 
{                                                          /* Bit Access       */
    uint8  MBC64:1;                                        /* MBC64            */
    uint8  MBC65:1;                                        /* MBC65            */
    uint8  MBC66:1;                                        /* MBC66            */
    uint8  MBC67:1;                                        /* MBC67            */
    uint8  MBC68:1;                                        /* MBC68            */
    uint8  MBC69:1;                                        /* MBC69            */
    uint8  MBC70:1;                                        /* MBC70            */
    uint8  MBC71:1;                                        /* MBC71            */
    uint8  MBC72:1;                                        /* MBC72            */
    uint8  MBC73:1;                                        /* MBC73            */
    uint8  MBC74:1;                                        /* MBC74            */
    uint8  MBC75:1;                                        /* MBC75            */
    uint8  MBC76:1;                                        /* MBC76            */
    uint8  MBC77:1;                                        /* MBC77            */
    uint8  MBC78:1;                                        /* MBC78            */
    uint8  MBC79:1;                                        /* MBC79            */
    uint8  MBC80:1;                                        /* MBC80            */
    uint8  MBC81:1;                                        /* MBC81            */
    uint8  MBC82:1;                                        /* MBC82            */
    uint8  MBC83:1;                                        /* MBC83            */
    uint8  MBC84:1;                                        /* MBC84            */
    uint8  MBC85:1;                                        /* MBC85            */
    uint8  MBC86:1;                                        /* MBC86            */
    uint8  MBC87:1;                                        /* MBC87            */
    uint8  MBC88:1;                                        /* MBC88            */
    uint8  MBC89:1;                                        /* MBC89            */
    uint8  MBC90:1;                                        /* MBC90            */
    uint8  MBC91:1;                                        /* MBC91            */
    uint8  MBC92:1;                                        /* MBC92            */
    uint8  MBC93:1;                                        /* MBC93            */
    uint8  MBC94:1;                                        /* MBC94            */
    uint8  MBC95:1;                                        /* MBC95            */
} __type64;
typedef struct 
{                                                          /* Bit Access       */
    uint8  MBC96:1;                                        /* MBC96            */
    uint8  MBC97:1;                                        /* MBC97            */
    uint8  MBC98:1;                                        /* MBC98            */
    uint8  MBC99:1;                                        /* MBC99            */
    uint8  MBC100:1;                                       /* MBC100           */
    uint8  MBC101:1;                                       /* MBC101           */
    uint8  MBC102:1;                                       /* MBC102           */
    uint8  MBC103:1;                                       /* MBC103           */
    uint8  MBC104:1;                                       /* MBC104           */
    uint8  MBC105:1;                                       /* MBC105           */
    uint8  MBC106:1;                                       /* MBC106           */
    uint8  MBC107:1;                                       /* MBC107           */
    uint8  MBC108:1;                                       /* MBC108           */
    uint8  MBC109:1;                                       /* MBC109           */
    uint8  MBC110:1;                                       /* MBC110           */
    uint8  MBC111:1;                                       /* MBC111           */
    uint8  MBC112:1;                                       /* MBC112           */
    uint8  MBC113:1;                                       /* MBC113           */
    uint8  MBC114:1;                                       /* MBC114           */
    uint8  MBC115:1;                                       /* MBC115           */
    uint8  MBC116:1;                                       /* MBC116           */
    uint8  MBC117:1;                                       /* MBC117           */
    uint8  MBC118:1;                                       /* MBC118           */
    uint8  MBC119:1;                                       /* MBC119           */
    uint8  MBC120:1;                                       /* MBC120           */
    uint8  MBC121:1;                                       /* MBC121           */
    uint8  MBC122:1;                                       /* MBC122           */
    uint8  MBC123:1;                                       /* MBC123           */
    uint8  MBC124:1;                                       /* MBC124           */
    uint8  MBC125:1;                                       /* MBC125           */
    uint8  MBC126:1;                                       /* MBC126           */
    uint8  MBC127:1;                                       /* MBC127           */
} __type65;
typedef struct 
{                                                          /* Bit Access       */
    uint32 MD:32;                                          /* MD[31:0]         */
} __type66;
typedef struct 
{                                                          /* Bit Access       */
    uint16 FID:11;                                         /* FID[10:0]        */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  CYC:7;                                          /* CYC[22:16]       */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  CH:2;                                           /* CH[25:24]        */
    uint8  CFG:1;                                          /* CFG              */
    uint8  PPIT:1;                                         /* PPIT             */
    uint8  TXM:1;                                          /* TXM              */
    uint8  MBI:1;                                          /* MBI              */
    uint8  :2;                                             /* Reserved Bits    */
} __type67;
typedef struct 
{                                                          /* Bit Access       */
    uint16 CRC:11;                                         /* CRC[10:0]        */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  PLC:7;                                          /* PLC[22:16]       */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type68;
typedef struct 
{                                                          /* Bit Access       */
    uint16 DP:11;                                          /* DP[10:0]         */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type69;
typedef struct 
{                                                          /* Bit Access       */
    uint8  LHSH:1;                                         /* LHSH             */
    uint8  LDSH:1;                                         /* LDSH             */
    uint8  STXRH:1;                                        /* STXRH            */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    const uint8  LHSS:1;                                   /* LHSS             */
    const uint8  LDSS:1;                                   /* LDSS             */
    const uint8  STXRS:1;                                  /* STXRS            */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type70;
typedef struct 
{                                                          /* Bit Access       */
    uint8  IBRH:7;                                         /* IBRH[6:0]        */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  :7;                                             /* Reserved Bits    */
    const uint8  IBSYH:1;                                  /* IBSYH            */
    const uint8  IBRS:7;                                   /* IBRS[22:16]      */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  :7;                                             /* Reserved Bits    */
    const uint8  IBSYS:1;                                  /* IBSYS            */
} __type71;
typedef struct 
{                                                          /* Bit Access       */
    const uint16 CRC:11;                                   /* CRC[10:0]        */
    uint8  :5;                                             /* Reserved Bits    */
    const uint8  PLC:7;                                    /* PLC[22:16]       */
    uint8  :1;                                             /* Reserved Bits    */
    const uint8  PLR:7;                                    /* PLR[30:24]       */
    uint8  :1;                                             /* Reserved Bits    */
} __type72;
typedef struct 
{                                                          /* Bit Access       */
    const uint16 DP:11;                                    /* DP[10:0]         */
    uint8  :5;                                             /* Reserved Bits    */
    const uint8  RCC:6;                                    /* RCC[21:16]       */
    uint8  :2;                                             /* Reserved Bits    */
    const uint8  RCI:1;                                    /* RCI              */
    const uint8  SFI:1;                                    /* SFI              */
    const uint8  SYN:1;                                    /* SYN              */
    const uint8  NFI:1;                                    /* NFI              */
    const uint8  PPI:1;                                    /* PPI              */
    const uint8  RES:1;                                    /* RES              */
    uint8  :2;                                             /* Reserved Bits    */
} __type73;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  VFRA:1;                                   /* VFRA             */
    const uint8  VFRB:1;                                   /* VFRB             */
    const uint8  SEOA:1;                                   /* SEOA             */
    const uint8  SEOB:1;                                   /* SEOB             */
    const uint8  CEOA:1;                                   /* CEOA             */
    const uint8  CEOB:1;                                   /* CEOB             */
    const uint8  SVOA:1;                                   /* SVOA             */
    const uint8  SVOB:1;                                   /* SVOB             */
    const uint8  TCIA:1;                                   /* TCIA             */
    const uint8  TCIB:1;                                   /* TCIB             */
    const uint8  ESA:1;                                    /* ESA              */
    const uint8  ESB:1;                                    /* ESB              */
    const uint8  MLST:1;                                   /* MLST             */
    uint8  :1;                                             /* Reserved Bits    */
    const uint8  FTA:1;                                    /* FTA              */
    const uint8  FTB:1;                                    /* FTB              */
    const uint8  CCS:6;                                    /* CCS[21:16]       */
    uint8  :2;                                             /* Reserved Bits    */
    const uint8  RCIS:1;                                   /* RCIS             */
    const uint8  SFIS:1;                                   /* SFIS             */
    const uint8  SYNS:1;                                   /* SYNS             */
    const uint8  NFIS:1;                                   /* NFIS             */
    const uint8  PPIS:1;                                   /* PPIS             */
    const uint8  RESS:1;                                   /* RESS             */
    uint8  :2;                                             /* Reserved Bits    */
} __type74;
typedef struct 
{                                                          /* Bit Access       */
    uint8  RHSS:1;                                         /* RHSS             */
    uint8  RDSS:1;                                         /* RDSS             */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    const uint8  RHSH:1;                                   /* RHSH             */
    const uint8  RDSH:1;                                   /* RDSH             */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type75;
typedef struct 
{                                                          /* Bit Access       */
    uint8  OBRS:7;                                         /* OBRS[6:0]        */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  VIEW:1;                                         /* VIEW             */
    uint8  REQ:1;                                          /* REQ              */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  OBSYS:1;                                        /* OBSYS            */
    const uint8  OBRH:7;                                   /* OBRH[22:16]      */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type76;
typedef struct 
{                                                          /* Bit Access       */
    uint8  ITE:1;                                          /* ITE              */
    uint8  IQHR:1;                                         /* IQHR             */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  IQFIE:1;                                        /* IQFIE            */
    uint8  IQEIE:1;                                        /* IQEIE            */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  ITM:7;                                          /* ITM[22:16]       */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type77;
typedef struct 
{                                                          /* Bit Access       */
    uint8  OTE:1;                                          /* OTE              */
    uint8  OTCS:1;                                         /* OTCS             */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  OIE:1;                                          /* OIE              */
    uint8  FIE:1;                                          /* FIE              */
    uint8  OWIE:1;                                         /* OWIE             */
    uint8  FWIE:1;                                         /* FWIE             */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  FTM:5;                                          /* FTM[20:16]       */
    uint8  :3;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type78;
typedef struct 
{                                                          /* Bit Access       */
    uint32 ITA:32;                                         /* ITA[31:0]        */
} __type79;
typedef struct 
{                                                          /* Bit Access       */
    uint32 FTA:32;                                         /* FTA[31:0]        */
} __type80;
typedef struct 
{                                                          /* Bit Access       */
    uint32 OTA:32;                                         /* OTA[31:0]        */
} __type81;
typedef struct 
{                                                          /* Bit Access       */
    uint8  IMBNR:7;                                        /* IMBNR[6:0]       */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type82;
typedef struct 
{                                                          /* Bit Access       */
    uint8  UIDX:8;                                         /* UIDX[7:0]        */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type83;
typedef struct 
{                                                          /* Bit Access       */
    uint8  UMBNR:7;                                        /* UMBNR[6:0]       */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  URDS:1;                                         /* URDS             */
    uint8  :6;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type84;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  ITS:1;                                    /* ITS              */
    const uint8  IQH:1;                                    /* IQH              */
    const uint8  UIRP:1;                                   /* UIRP             */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  IQFIS:1;                                        /* IQFIS            */
    uint8  IQEIS:1;                                        /* IQEIS            */
    uint8  :2;                                             /* Reserved Bits    */
    const uint8  IQFP:1;                                   /* IQFP             */
    uint8  :3;                                             /* Reserved Bits    */
    const uint8  IPIDX:7;                                  /* IPIDX[22:16]     */
    uint8  :1;                                             /* Reserved Bits    */
    const uint8  IGIDX:7;                                  /* IGIDX[30:24]     */
    uint8  :1;                                             /* Reserved Bits    */
} __type85;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  OTS:1;                                    /* OTS              */
    uint8  :1;                                             /* Reserved Bits    */
    const uint8  UORP:1;                                   /* UORP             */
    uint8  :5;                                             /* Reserved Bits    */
    uint8  OTIS:1;                                         /* OTIS             */
    uint8  FIS:1;                                          /* FIS              */
    uint8  OWIS:1;                                         /* OWIS             */
    uint8  FWIS:1;                                         /* FWIS             */
    uint8  :1;                                             /* Reserved Bits    */
    uint8  FDA:1;                                          /* FDA              */
    const uint8  OWP:1;                                    /* OWP              */
    const uint8  FWP:1;                                    /* FWP              */
    const uint8  FGIDX:5;                                  /* FGIDX[20:16]     */
    uint8  :3;                                             /* Reserved Bits    */
    const uint8  FFL:6;                                    /* FFL[29:24]       */
    uint8  :2;                                             /* Reserved Bits    */
} __type86;
typedef struct 
{                                                          /* Bit Access       */
    const uint8  EIDX:8;                                   /* EIDX[7:0]        */
    uint8  IAE:1;                                          /* IAE              */
    uint8  OAE:1;                                          /* OAE              */
    uint8  FAE:1;                                          /* FAE              */
    uint8  MAE:1;                                          /* MAE              */
    uint8  :4;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
    uint8  :8;                                             /* Reserved Bits    */
} __type87;
typedef struct 
{                                                          /* Bit Access       */
    const uint32 AEA:32;                                   /* AEA[31:0]        */
} __type88;
typedef struct 
{                                                          /* Bit Access       */
    uint8  DA0:1;                                          /* DA0              */
    uint8  DA1:1;                                          /* DA1              */
    uint8  DA2:1;                                          /* DA2              */
    uint8  DA3:1;                                          /* DA3              */
    uint8  DA4:1;                                          /* DA4              */
    uint8  DA5:1;                                          /* DA5              */
    uint8  DA6:1;                                          /* DA6              */
    uint8  DA7:1;                                          /* DA7              */
    uint8  DA8:1;                                          /* DA8              */
    uint8  DA9:1;                                          /* DA9              */
    uint8  DA10:1;                                         /* DA10             */
    uint8  DA11:1;                                         /* DA11             */
    uint8  DA12:1;                                         /* DA12             */
    uint8  DA13:1;                                         /* DA13             */
    uint8  DA14:1;                                         /* DA14             */
    uint8  DA15:1;                                         /* DA15             */
    uint8  DA16:1;                                         /* DA16             */
    uint8  DA17:1;                                         /* DA17             */
    uint8  DA18:1;                                         /* DA18             */
    uint8  DA19:1;                                         /* DA19             */
    uint8  DA20:1;                                         /* DA20             */
    uint8  DA21:1;                                         /* DA21             */
    uint8  DA22:1;                                         /* DA22             */
    uint8  DA23:1;                                         /* DA23             */
    uint8  DA24:1;                                         /* DA24             */
    uint8  DA25:1;                                         /* DA25             */
    uint8  DA26:1;                                         /* DA26             */
    uint8  DA27:1;                                         /* DA27             */
    uint8  DA28:1;                                         /* DA28             */
    uint8  DA29:1;                                         /* DA29             */
    uint8  DA30:1;                                         /* DA30             */
    uint8  DA31:1;                                         /* DA31             */
} __type89;
typedef struct 
{                                                          /* Bit Access       */
    uint8  DA32:1;                                         /* DA32             */
    uint8  DA33:1;                                         /* DA33             */
    uint8  DA34:1;                                         /* DA34             */
    uint8  DA35:1;                                         /* DA35             */
    uint8  DA36:1;                                         /* DA36             */
    uint8  DA37:1;                                         /* DA37             */
    uint8  DA38:1;                                         /* DA38             */
    uint8  DA39:1;                                         /* DA39             */
    uint8  DA40:1;                                         /* DA40             */
    uint8  DA41:1;                                         /* DA41             */
    uint8  DA42:1;                                         /* DA42             */
    uint8  DA43:1;                                         /* DA43             */
    uint8  DA44:1;                                         /* DA44             */
    uint8  DA45:1;                                         /* DA45             */
    uint8  DA46:1;                                         /* DA46             */
    uint8  DA47:1;                                         /* DA47             */
    uint8  DA48:1;                                         /* DA48             */
    uint8  DA49:1;                                         /* DA49             */
    uint8  DA50:1;                                         /* DA50             */
    uint8  DA51:1;                                         /* DA51             */
    uint8  DA52:1;                                         /* DA52             */
    uint8  DA53:1;                                         /* DA53             */
    uint8  DA54:1;                                         /* DA54             */
    uint8  DA55:1;                                         /* DA55             */
    uint8  DA56:1;                                         /* DA56             */
    uint8  DA57:1;                                         /* DA57             */
    uint8  DA58:1;                                         /* DA58             */
    uint8  DA59:1;                                         /* DA59             */
    uint8  DA60:1;                                         /* DA60             */
    uint8  DA61:1;                                         /* DA61             */
    uint8  DA62:1;                                         /* DA62             */
    uint8  DA63:1;                                         /* DA63             */
} __type90;
typedef struct 
{                                                          /* Bit Access       */
    uint8  DA64:1;                                         /* DA64             */
    uint8  DA65:1;                                         /* DA65             */
    uint8  DA66:1;                                         /* DA66             */
    uint8  DA67:1;                                         /* DA67             */
    uint8  DA68:1;                                         /* DA68             */
    uint8  DA69:1;                                         /* DA69             */
    uint8  DA70:1;                                         /* DA70             */
    uint8  DA71:1;                                         /* DA71             */
    uint8  DA72:1;                                         /* DA72             */
    uint8  DA73:1;                                         /* DA73             */
    uint8  DA74:1;                                         /* DA74             */
    uint8  DA75:1;                                         /* DA75             */
    uint8  DA76:1;                                         /* DA76             */
    uint8  DA77:1;                                         /* DA77             */
    uint8  DA78:1;                                         /* DA78             */
    uint8  DA79:1;                                         /* DA79             */
    uint8  DA80:1;                                         /* DA80             */
    uint8  DA81:1;                                         /* DA81             */
    uint8  DA82:1;                                         /* DA82             */
    uint8  DA83:1;                                         /* DA83             */
    uint8  DA84:1;                                         /* DA84             */
    uint8  DA85:1;                                         /* DA85             */
    uint8  DA86:1;                                         /* DA86             */
    uint8  DA87:1;                                         /* DA87             */
    uint8  DA88:1;                                         /* DA88             */
    uint8  DA89:1;                                         /* DA89             */
    uint8  DA90:1;                                         /* DA90             */
    uint8  DA91:1;                                         /* DA91             */
    uint8  DA92:1;                                         /* DA92             */
    uint8  DA93:1;                                         /* DA93             */
    uint8  DA94:1;                                         /* DA94             */
    uint8  DA95:1;                                         /* DA95             */
} __type91;
typedef struct 
{                                                          /* Bit Access       */
    uint8  DA96:1;                                         /* DA96             */
    uint8  DA97:1;                                         /* DA97             */
    uint8  DA98:1;                                         /* DA98             */
    uint8  DA99:1;                                         /* DA99             */
    uint8  DA100:1;                                        /* DA100            */
    uint8  DA101:1;                                        /* DA101            */
    uint8  DA102:1;                                        /* DA102            */
    uint8  DA103:1;                                        /* DA103            */
    uint8  DA104:1;                                        /* DA104            */
    uint8  DA105:1;                                        /* DA105            */
    uint8  DA106:1;                                        /* DA106            */
    uint8  DA107:1;                                        /* DA107            */
    uint8  DA108:1;                                        /* DA108            */
    uint8  DA109:1;                                        /* DA109            */
    uint8  DA110:1;                                        /* DA110            */
